//Johnny-five Servo API 解釋

//---------- .to() ---------------
var servo = new five.Servo(10);

// 轉動舵轉動到90度
servo.to(90);

// 花500毫秒的時間將轉動舵轉動到90度
servo.to(90, 500);

// 花500毫秒的時間，分10次將轉動舵轉動到90度
servo.to(90, 500, 10);
//----------------------------------

//---------- .min() ---------------
//範例一
var servo = new five.Servo(10);
servo.min(); //轉動舵轉動到0度

//範例二
var servo = new five.Servo({
  pin: 10,
  range: [45, 135] //宣告最小轉動角度為45度
});

servo.min(); //轉動舵轉動到最小轉動角度45度
//----------------------------------

//---------- .max() ---------------
//範例一
var servo = new five.Servo(10);
servo.max(); //轉動舵轉動到180度

//範例二
var servo = new five.Servo({
  pin: 10,
  range: [45, 135] //宣告最大轉動角度為135度
});

servo.max(); //轉動舵轉動到最大轉動角度135度
//----------------------------------

//---------- .center() ---------------
//範例一
var servo = new five.Servo(10);
// 因最大角度為180度，180/2=90，故中間值為90度，轉動舵轉動到90度
servo.center();

//範例二
var servo = new five.Servo({
  pin: 10,
  range: [40, 80]
});
//40度～80度的中間值為角度60度，故轉動舵轉動到60度
servo.center();
//----------------------------------

//---------- .home() ---------------
var servo = new five.Servo({
  pin: 10,
  startAt: 20
});
// 設置轉動舵轉動到90度
servo.to(90);
// 轉動舵返回startAt設置的角度值20度
servo.home();
//----------------------------------
